// 2020/4
// var moneyStr = '吃饭-130  日用-15  健康-8  吃饭-244  交通-51  日用-50  吃饭-365  交通-13  健康-16  下馆子-165  学习-30  房租-2512  吃饭-302  交通-46  日用-66  下馆子-206  吃饭-252  交通-36  健康-126';
// 2020.2
// var moneyStr = '吃饭-524  交通-76  健康-532  娱乐-68  健康-695  吃饭-182  交通-28  日用-459  娱乐-47  吃饭-475  健康-13  娱乐-140  交通-18  学习-70  水奶-45  房租-2468  吃饭-143  交通-9  健康-160  日用-60  话费-50  吃饭-323  娱乐-40  交通-5  话费-200  健康-56  日用-35  吃饭-343  日用-125  学习-28  娱乐-10  健康-108  吃饭-86  健康-82  学习-135  房租-2477  吃饭-216  日用-52  学习-30  娱乐-369  健康-100  交通-108  话费-196  吃饭-164  日用-246   健康-68  吃饭-110  日用-32  娱乐-100';
// var moneyStr = '吃饭-343  日用-125  学习-28  娱乐-10  健康-108  吃饭-86  健康-82  学习-135  房租-2477  吃饭-216  日用-52  学习-30  娱乐-369  健康-100  交通-108  话费-196  吃饭-164  日用-246   健康-68  吃饭-110  日用-32  娱乐-100';
// var moneyStr = '吃饭-524  交通-76  健康-532  娱乐-68  健康-695  吃饭-182  交通-28  日用-459  娱乐-47  吃饭-475  健康-13  娱乐-140  交通-18  学习-70  水奶-45  房租-2468  吃饭-143  交通-9  健康-160  日用-60  话费-50  吃饭-323  娱乐-40  交通-5  话费-200  健康-56  日用-35';
var moneyStr = '吃饭-428  日用-198  健康-149  交通-307  下馆子-85  娱乐-440  吃饭-196  娱乐-123  日用-60  交通-38  健康-6  学习-232  房租-2490  吃饭-85  娱乐-59  下馆子-200  娱乐-82  交通-136  吃饭-292  娱乐-158  下馆子-106  交通-38  日用-10  吃饭-92  娱乐-93  下馆子-558  交通-604  电子-1587  健康-580  交通-3641  衣服-137';

function calcCertainType(type) {
  var arr = moneyStr.split('  ').filter(item => item.indexOf(type) > -1).map(ele => parseInt(ele.split('-')[1]));
  return sum(arr);
}

function sum(arr) {
  return arr.reduce(function(prev, curr, idx, arr){
    return prev + curr;
  }, 0);
}

function runIt() {
  var sum = 0;
  var typeArr = moneyStr.split('  ').map(item => item.split('-')[0]);
  typeArr = [...new Set(typeArr)];
  console.log(typeArr);
  typeArr.forEach(item => {
    var tempRes = calcCertainType(item);
    console.log(`${item}: ${tempRes}元`)
    sum += tempRes;
  })
  console.log(`总计：${sum}元`)

}

runIt();
